finance/PortfolioOptimization.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLES: PortfolioOptimization
#+DATE: <2017-07-05 Wed>
#+AUTHORS: weiwu
#+EMAIL: victor.wuv@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)

[[file:../CS/Python/py4fi/Optimization.html][PortfolioOptimization]]
* Portfolio Optimization
- risk parity portfolios (Roncalli, 2013)
- Black–Litterman portfolios (Black and Litterman, 1992)
- log-optimal portfolios (Cover and Ordentlich, 1996)
- conditional value at risk (cVaR) and coherent risk measures for portfolios (Rockafellar and Uryasev, 2000)

* Basics

** alpha
Alpha is used to determine by how much the realized return of the portfolio varies from the required return, as determined by CAPM.
$$\alpha = R_{portfolio} - [R_f + (R_m - R_f)\beta]$$
** Quadratic function
In algebra, a quadratic function, a quadratic polynomial, a polynomial of degree 2, or simply a quadratic, is a polynomial function in one or more variables in which the highest-degree term is of the second degree. For example, a quadratic function in three variables x, y, and z contains exclusively terms x2, y2, z2, xy, xz, yz, x, y, z, and a constant:

$$
{\displaystyle f(x,y,z)=ax^{2}+by^{2}+cz^{2}+dxy+exz+fyz+gx+hy+iz+j,} f(x,y,z)=ax^{2}+by^{2}+cz^{2}+dxy+exz+fyz+gx+hy+iz+j,$$
with at least one of the coefficients a, b, c, d, e, or f of the second-degree terms being non-zero.

** Quadratic programming
- Quadratic programming (QP) is the process of solving a special type of mathematical optimization problem—specifically, a (linearly constrained) quadratic optimization problem, that is, the problem of optimizing (minimizing or maximizing) a quadratic function of several variables subject to linear constraints on these variables. Quadratic programming is a particular type of nonlinear programming.
** Nonlinear programming
the process of solving an optimization problem defined by a system of equalities and inequalities, collectively termed constraints, over a set of unknown real variables, along with an objective function to be maximized or minimized, where some of the constraints or the objective function are nonlinear.
** Equality constraints
Quadratic programming is particularly simple when Q is positive definite and there are only equality constraints; specifically, the solution process is linear. By using Lagrange multipliers and seeking the extremum of the Lagrangian, it may be readily shown that the solution to the equality constrained problem
$${\text{Minimize}}\quad {\tfrac {1}{2}}\mathbf {x} ^{\mathrm {T} }Q\mathbf {x} +\mathbf {c} ^{\mathrm {T} }\mathbf {x}
{\text{subject to}}\quad E\mathbf {x} =\mathbf {d}$$

is given by the linear system

$${\begin{bmatrix}Q&E^{T}\\E&0\end{bmatrix}}{\begin{bmatrix}\mathbf {x} \\\lambda \end{bmatrix}}={\begin{bmatrix}-\mathbf {c} \\\mathbf {d} \end{bmatrix}}$$
where ${\displaystyle \lambda }$  is a set of Lagrange multipliers which come out of the solution alongside ${\displaystyle \mathbf {x} }$ .



OLS assumptions:
- Linear in Parameters
- Random Sample of n Observations
- Zero Conditional Mean
- No Perfect Collinearity
- Homoskedasticity

Pitfall of Modern Portfolio Theory(MPT):
- It is based on the historical return performance. If the political visk shows up or the fund changes policy or manager, the corporate or the fund performance may change.

* Sparse Markowitz Portfolios

* Mean-Reverting Portfolios

* Active portfolio management

** overview
Modern portfolio theory looks at total risk and total return.

The institutional investor cares about active risk and active return.
For that reason, we will concentrate on the more general problem of managing relative to a benchmark.
This focus on active management arises for several *reasons*:

*** risk aversion from unknown categories.
Clients can clump the large number of investment advisers into recognizable categories. With the advisers thus pigeonholed, the client (or consultant) can restrict searches and peer comparisons to pigeons in the same hole.

*** tracking the benchmark
The benchmark acts as a set of instructions from the fund sponsor, as principal, to the investment manager, as agent. The benchmark defines the manager’s investment neighborhood. Moves away from the benchmark carry substantial investment and business risk.

*** easy tracking for management
Benchmarks allow the trustee or sponsor to manage the aggregate portfolio without complete knowledge of the holdings of each manager. The sponsor can manage a mix of benchmarks, keeping the “big picture.""

