docs/finance/PortfolioOptimization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-09 Mon 09:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Portfolio Optimization objective functions</a></li>
<li><a href="#orgheadline9">2. Basics</a>
<ul>
<li><a href="#orgheadline2">2.1. Risk aversion parameter</a></li>
<li><a href="#orgheadline3">2.2. alpha</a></li>
<li><a href="#orgheadline4">2.3. Quadratic function</a></li>
<li><a href="#orgheadline5">2.4. Quadratic programming</a></li>
<li><a href="#orgheadline6">2.5. Nonlinear programming</a></li>
<li><a href="#orgheadline7">2.6. Equality constraints</a></li>
<li><a href="#orgheadline8">2.7. Regime shifts</a></li>
</ul>
</li>
<li><a href="#orgheadline10">3. Sparse Markowitz Portfolios</a></li>
<li><a href="#orgheadline11">4. Mean-Reverting Portfolios</a></li>
<li><a href="#orgheadline16">5. Active portfolio management</a>
<ul>
<li><a href="#orgheadline15">5.1. overview</a>
<ul>
<li><a href="#orgheadline12">5.1.1. risk aversion from unknown categories.</a></li>
<li><a href="#orgheadline13">5.1.2. tracking the benchmark</a></li>
<li><a href="#orgheadline14">5.1.3. easy tracking for management</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline17">6. Exceptional Return, benchmarks and value added</a></li>
<li><a href="#orgheadline35">7. Portfolio Construction</a>
<ul>
<li><a href="#orgheadline18">7.1. input:</a></li>
<li><a href="#orgheadline30">7.2. constraints</a>
<ul>
<li><a href="#orgheadline25">7.2.1. alpha constraint</a></li>
<li><a href="#orgheadline26">7.2.2. risk aversion</a></li>
<li><a href="#orgheadline29">7.2.3. transaction cost</a></li>
</ul>
</li>
<li><a href="#orgheadline31">7.3. SCREENS</a></li>
<li><a href="#orgheadline32">7.4. Stratification</a></li>
<li><a href="#orgheadline33">7.5. comparison with asset selection and asset allocation</a></li>
<li><a href="#orgheadline34">7.6. solution</a></li>
</ul>
</li>
<li><a href="#orgheadline38">8. Asset Allocation</a>
<ul>
<li><a href="#orgheadline36">8.1. tactical asset allocation</a></li>
<li><a href="#orgheadline37">8.2. asset allocation strategies is a three-step process:</a></li>
</ul>
</li>
<li><a href="#orgheadline39">9. Black litterman model step-by-step</a></li>
<li><a href="#orgheadline40">10. NLP</a></li>
</ul>
</div>
</div>
<p>
<a href="../CS/Python/py4fi/Optimization.html">PortfolioOptimizationJupyterProgramming</a>
</p>

<p>
<a href="../CS/Python/py4fi/PortfolioOptimization.html">PortfolioOptimizationReadMe</a>
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Portfolio Optimization objective functions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>risk parity portfolios (Roncalli, 2013)</li>
<li>Black–Litterman portfolios (Black and Litterman, 1992)</li>
<li>log-optimal portfolios (Cover and Ordentlich, 1996)</li>
<li>conditional value at risk (cVaR) and coherent risk measures for portfolios (Rockafellar and Uryasev, 2000)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">2</span> Basics</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Risk aversion parameter</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The weight vector that maximizes the expected portfolio growth rate E log(1 + Rtp) (subject to 1T w = 1, w ≥ 0) is called the Kelly optimal portfolio or log-optimal portfolio. Using the quadratic approximation of the logarithm log(1 + a) ≈ a − (1/2)a2 we obtain
\[E[log(1 + Rtp)] ≈ E[Rtp − (1/2)(Rtp)2]
= µT w − (1/2)wT (Σ + µµT )w\],
</p>

<p>
where µ = Ert and Σ = E(rt−µ)(rt−µ)T are the mean and covariance of the return rt.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> alpha</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Alpha is used to determine by how much the realized return of the portfolio varies from the required return, as determined by CAPM.
\[\alpha = R_{portfolio} - [R_f + (R_m - R_f)\beta]\]
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> Quadratic function</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In algebra, a quadratic function, a quadratic polynomial, a polynomial of degree 2, or simply a quadratic, is a polynomial function in one or more variables in which the highest-degree term is of the second degree. For example, a quadratic function in three variables x, y, and z contains exclusively terms x2, y2, z2, xy, xz, yz, x, y, z, and a constant:
</p>

<p>
\[
{\displaystyle f(x,y,z)=ax^{2}+by^{2}+cz^{2}+dxy+exz+fyz+gx+hy+iz+j,} f(x,y,z)=ax^{2}+by^{2}+cz^{2}+dxy+exz+fyz+gx+hy+iz+j,\]
with at least one of the coefficients a, b, c, d, e, or f of the second-degree terms being non-zero.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.4</span> Quadratic programming</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Quadratic programming (QP) is the process of solving a special type of mathematical optimization problem—specifically, a (linearly constrained) quadratic optimization problem, that is, the problem of optimizing (minimizing or maximizing) a quadratic function of several variables subject to linear constraints on these variables. Quadratic programming is a particular type of nonlinear programming.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.5</span> Nonlinear programming</h3>
<div class="outline-text-3" id="text-2-5">
<p>
the process of solving an optimization problem defined by a system of equalities and inequalities, collectively termed constraints, over a set of unknown real variables, along with an objective function to be maximized or minimized, where some of the constraints or the objective function are nonlinear.
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.6</span> Equality constraints</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Quadratic programming is particularly simple when Q is positive definite and there are only equality constraints; specifically, the solution process is linear. By using Lagrange multipliers and seeking the extremum of the Lagrangian, it may be readily shown that the solution to the equality constrained problem
\[{\text{Minimize}}\quad {\tfrac {1}{2}}\mathbf {x} ^{\mathrm {T} }Q\mathbf {x} +\mathbf {c} ^{\mathrm {T} }\mathbf {x}
{\text{subject to}}\quad E\mathbf {x} =\mathbf {d}\]
</p>

<p>
is given by the linear system
</p>

<p>
\[{\begin{bmatrix}Q&E^{T}\\E&0\end{bmatrix}}{\begin{bmatrix}\mathbf {x} \\\lambda \end{bmatrix}}={\begin{bmatrix}-\mathbf {c} \\\mathbf {d} \end{bmatrix}}\]
where \({\displaystyle \lambda }\)  is a set of Lagrange multipliers which come out of the solution alongside \({\displaystyle \mathbf {x} }\) .
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.7</span> Regime shifts</h3>
<div class="outline-text-3" id="text-2-7">
<p>
OLS assumptions:
</p>
<ul class="org-ul">
<li>Linear in Parameters</li>
<li>Random Sample of n Observations</li>
<li>Zero Conditional Mean</li>
<li>No Perfect Collinearity</li>
<li>Homoskedasticity</li>
</ul>

<p>
Pitfall of Modern Portfolio Theory(MPT):
</p>
<ul class="org-ul">
<li>It is based on the historical return performance. If the political visk shows up or the fund changes policy or manager, the corporate or the fund performance may change.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">3</span> Sparse Markowitz Portfolios</h2>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">4</span> Mean-Reverting Portfolios</h2>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">5</span> Active portfolio management</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">5.1</span> overview</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Modern portfolio theory looks at total risk and total return.
</p>

<p>
The institutional investor cares about active risk and active return.
For that reason, we will concentrate on the more general problem of managing relative to a benchmark.
This focus on active management arises for several <b>reasons</b>:
</p>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">5.1.1</span> risk aversion from unknown categories.</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Clients can clump the large number of investment advisers into recognizable categories. With the advisers thus pigeonholed, the client (or consultant) can restrict searches and peer comparisons to pigeons in the same hole.
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">5.1.2</span> tracking the benchmark</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
The benchmark acts as a set of instructions from the fund sponsor, as principal, to the investment manager, as agent. The benchmark defines the manager’s investment neighborhood. Moves away from the benchmark carry substantial investment and business risk.
</p>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">5.1.3</span> easy tracking for management</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Benchmarks allow the trustee or sponsor to manage the aggregate portfolio without complete knowledge of the holdings of each manager. The sponsor can manage a mix of benchmarks, keeping the “big picture.""
</p>
</div>
</div>
</div>
</div>
