finance/PortfolioOptimization.org
* Exceptional Return, benchmarks and value added
The CAPM provides consensus expected returns. A multiple-factor model can help to control risk.

accurate forecasts of expected return.
a riskfree component (the time premium), a benchmark component$\beta_n \mu_B$  (the risk premium), a benchmark timing component$\beta_n \delta f_B$ (exceptional benchmark return), and an alpha (expected residual return). If Rn is the total return on asset n.
$$E{R_n} = 1 + i_F + \beta_n \mu_B + \beta_n \delta f_B + \alpha_n$$
- $\beta_n = \frac{Cov{r_n,r_B}}{Var{r_B}}$
- The Risk Premium $\beta_n \mu_B$
The expected excess return on the benchmark, $\mu_B$, is usually estimated by analysts as a very long run (70+ years) average (although other estimation methods are common). A number between 3 and 7 percent per annum is reasonable for most equity markets.
- Exceptional Benchmark return $\beta_n \Delta f_B$
$\Delta f_B$ is your measure of that difference between the expected excess return on the benchmark in the near future and the long-run expected excess return.
- $\alpha_n$
expected residual return, $\alpha_n = E{\Theta_n}.$
| parameters  | meaning                                                 |
|-------------+---------------------------------------------------------|
| $\beta_n$   | the forecast beta of the portfolio versus the benchmark |
| $r_f$       | risk-free return                                        |
| $\mu_B$     | benchmark return over the last period(monthly)          |
| $\Delta f_B$ | $r_p - r_f - \mu_B$                                     |
| f_b         | $\displaystyle\sum_{n} h_B(n)E{R_N}-(1+i_F)$            |

* Portfolio Construction

** input:
- the current portfolio(with certainty)
- alphas(often unreasonable and subject to hidden biases)
- covariance estimates(noisy estimates)
- transactions cost estimates(noisy estimates)
- an active risk aversion(self-biased)
** constraints
*We can replace any portfolio construction process, regardless of its sophistication, by a process that first refines the alphas and then uses a simple unconstrained mean/variance optimization to determine the active positions.*
*** alpha constraint
- most institutional portfolio managers do not take short positions and limit the amount of cash in the portfolio.
- Others may restrict asset coverage because of requirements concerning liquidity, self-dealing, and so on.
- A manager may require that the portfolio be neutral across economic sectors or industries.
- The manager may limit individual stock positions to ensure diversification of the active bets.
- The manager may want to avoid any position based on a forecast of the benchmark portfolio’s performance.
- portfolio holdings cannot exceed benchmark holdings by more than 5%.
**** Scale the Alphas
$$\alpha=volatility*IC*score$$
**** Trim Alpha Outliers
**** Neutralization
**** Risk-Factor-Neutral Alphas
**** For index-tracking portfolios
- Take advantage of ﬂexible options for risk control.
  - Minimize the tracking error of your portfolio in the objective or place a hard limit on tracking error using a risk constraint.
  - Use more than one risk model to incorporate several perspectives on risk.
  - Include risk elements that use more than one benchmark or model portfolio.
- Incorporate all the transaction-related costs that impact performance. The transaction cost types available in the optimizer can be used in any combination to accurately reﬂect overall costs.
  - Capture market impact using non-linear market-impact models (quadratic, 3/2, and 5/3 powers) or a piecewiselinear approximation.
  - Use the fully integrated Goldman Sachs Shortfall Model.
  - Include commissions and brokerage fees using linear costs.
- Place explicit limits on trading activity.
  - Limit overall portfolio turnover or limit turnover of a set of assets.
  - Place asset-specifc limits on trading; for example, limit trade size to a fraction of average daily volume.
- Control portfolio beta using Axioma-provided historical betas, predicted betas computed relative to any benchmark you choose, or betas you supply.
- Limit the number of names held or traded
**** For actively managed portfolios…
In addition to the risk and transaction cost controls available for passive portfolio management, the modeling library contains many options designed to get the most from your alpha signal.
• Augment your risk control using the Alpha Factor. The Alpha Factor compensates for components of your alpha signal that are not included in the risk model, providing more accurate predicted risk estimates.
• Limit risk contributions at the factor or asset level.
• Use Robust Optimization to explicitly incorporate uncertainty in your alpha estimates.
• Incorporate additional tilts in your objective. Tilts can be implemented on any factor, including risk factors, factors from one of Axioma’s factor libraries, or user-supplied factors.
• Prevent small positions and small trades with threshold constraints.
*** risk aversion

*** transaction cost

**** on stock side
- Transactions costs increase with trade size and the desire for quick execution, which help to identify the manager as an informed trader and require increased inventory risk by the liquidity supplier.
- Transactions costs are difficult to measure. At the same time, accurate estimates of transactions costs, especially distinctions in transactions costs among different stock trades, can significantly affect realized value added.
- Transactions costs lower value added, but you can often achieve at least 75 percent of the value added with only half the turnover (and half the transactions costs). You can do better by distinguishing stocks by their transactions costs.
- Trading is itself a portfolio optimization problem, distinct from the portfolio construction problem. Optimal trading can lower transactions costs, though at the expense of additional short-term risk.
- There are several options for trade implementation, with rules of thumb on which to use when.
  - VWAP.
  - BARRA model.

**** on portfolio side
- construct portfolio relative to industry neutral with categories.
