docs/finance/PortfolioOptimization.html

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">6</span> Exceptional Return, benchmarks and value added</h2>
<div class="outline-text-2" id="text-6">
<p>
The CAPM provides consensus expected returns. A multiple-factor model can help to control risk.
</p>

<p>
accurate forecasts of expected return.
a riskfree component (the time premium), a benchmark component\(\beta_n \mu_B\)  (the risk premium), a benchmark timing component\(\beta_n \delta f_B\) (exceptional benchmark return), and an alpha (expected residual return). If Rn is the total return on asset n.
\[E{R_n} = 1 + i_F + \beta_n \mu_B + \beta_n \delta f_B + \alpha_n\]
</p>
<ul class="org-ul">
<li>\(\beta_n = \frac{Cov{r_n,r_B}}{Var{r_B}}\)</li>
<li>The Risk Premium \(\beta_n \mu_B\)</li>
</ul>
<p>
The expected excess return on the benchmark, \(\mu_B\), is usually estimated by analysts as a very long run (70+ years) average (although other estimation methods are common). A number between 3 and 7 percent per annum is reasonable for most equity markets.
</p>
<ul class="org-ul">
<li>Exceptional Benchmark return \(\beta_n \Delta f_B\)</li>
</ul>
<p>
\(\Delta f_B\) is your measure of that difference between the expected excess return on the benchmark in the near future and the long-run expected excess return.
</p>
<ul class="org-ul">
<li>\(\alpha_n\)</li>
</ul>
<p>
expected residual return, $&alpha;<sub>n</sub> = E{&Theta;<sub>n</sub>}.$
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">parameters</th>
<th scope="col" class="org-left">meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(\beta_n\)</td>
<td class="org-left">the forecast beta of the portfolio versus the benchmark</td>
</tr>

<tr>
<td class="org-left">\(r_f\)</td>
<td class="org-left">risk-free return</td>
</tr>

<tr>
<td class="org-left">\(\mu_B\)</td>
<td class="org-left">benchmark return over the last period(monthly)</td>
</tr>

<tr>
<td class="org-left">\(\Delta f_B\)</td>
<td class="org-left">\(r_p - r_f - \mu_B\)</td>
</tr>

<tr>
<td class="org-left">f<sub>b</sub></td>
<td class="org-left">\(\displaystyle\sum_{n} h_B(n)E{R_N}-(1+i_F)\)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-2">
<h2 id="orgheadline35"><span class="section-number-2">7</span> Portfolio Construction</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">7.1</span> input:</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>the current portfolio(with certainty)</li>
<li>alphas(often unreasonable and subject to hidden biases)</li>
<li>covariance estimates(noisy estimates)</li>
<li>transactions cost estimates(noisy estimates)</li>
<li>an active risk aversion(self-biased)</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">7.2</span> constraints</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<b>We can replace any portfolio construction process, regardless of its sophistication, by a process that first refines the alphas and then uses a simple unconstrained mean/variance optimization to determine the active positions.</b>
</p>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">7.2.1</span> alpha constraint</h4>
<div class="outline-text-4" id="text-7-2-1">
<ul class="org-ul">
<li>most institutional portfolio managers do not take short positions and limit the amount of cash in the portfolio.</li>
<li>Others may restrict asset coverage because of requirements concerning liquidity, self-dealing, and so on.</li>
<li>A manager may require that the portfolio be neutral across economic sectors or industries.</li>
<li>The manager may limit individual stock positions to ensure diversification of the active bets.</li>
<li>The manager may want to avoid any position based on a forecast of the benchmark portfolio’s performance.</li>
<li>portfolio holdings cannot exceed benchmark holdings by more than 5%.</li>
</ul>
</div>
<ol class="org-ol"><li><a id="orgheadline19"></a>Scale the Alphas<br  /><div class="outline-text-5" id="text-7-2-1-1">
<p>
\[\alpha=volatility*IC*score\]
</p>
</div></li>
<li><a id="orgheadline20"></a>Trim Alpha Outliers<br  /></li>
<li><a id="orgheadline21"></a>Neutralization<br  /></li>
<li><a id="orgheadline22"></a>Risk-Factor-Neutral Alphas<br  /></li>
<li><a id="orgheadline23"></a>For index-tracking portfolios<br  /><div class="outline-text-5" id="text-7-2-1-5">
<ul class="org-ul">
<li>Take advantage of ﬂexible options for risk control.
<ul class="org-ul">
<li>Minimize the tracking error of your portfolio in the objective or place a hard limit on tracking error using a risk constraint.</li>
<li>Use more than one risk model to incorporate several perspectives on risk.</li>
<li>Include risk elements that use more than one benchmark or model portfolio.</li>
</ul></li>
<li>Incorporate all the transaction-related costs that impact performance. The transaction cost types available in the optimizer can be used in any combination to accurately reﬂect overall costs.
<ul class="org-ul">
<li>Capture market impact using non-linear market-impact models (quadratic, 3/2, and 5/3 powers) or a piecewiselinear approximation.</li>
<li>Use the fully integrated Goldman Sachs Shortfall Model.</li>
<li>Include commissions and brokerage fees using linear costs.</li>
</ul></li>
<li>Place explicit limits on trading activity.
<ul class="org-ul">
<li>Limit overall portfolio turnover or limit turnover of a set of assets.</li>
<li>Place asset-specifc limits on trading; for example, limit trade size to a fraction of average daily volume.</li>
</ul></li>
<li>Control portfolio beta using Axioma-provided historical betas, predicted betas computed relative to any benchmark you choose, or betas you supply.</li>
<li>Limit the number of names held or traded</li>
</ul>
</div></li>
<li><a id="orgheadline24"></a>For actively managed portfolios…<br  /><div class="outline-text-5" id="text-7-2-1-6">
<p>
In addition to the risk and transaction cost controls available for passive portfolio management, the modeling library contains many options designed to get the most from your alpha signal.
• Augment your risk control using the Alpha Factor. The Alpha Factor compensates for components of your alpha signal that are not included in the risk model, providing more accurate predicted risk estimates.
• Limit risk contributions at the factor or asset level.
• Use Robust Optimization to explicitly incorporate uncertainty in your alpha estimates.
• Incorporate additional tilts in your objective. Tilts can be implemented on any factor, including risk factors, factors from one of Axioma’s factor libraries, or user-supplied factors.
• Prevent small positions and small trades with threshold constraints.
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">7.2.2</span> risk aversion</h4>
</div>

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">7.2.3</span> transaction cost</h4>
<div class="outline-text-4" id="text-7-2-3">
</div><ol class="org-ol"><li><a id="orgheadline27"></a>on stock side<br  /><div class="outline-text-5" id="text-7-2-3-1">
<ul class="org-ul">
<li>Transactions costs increase with trade size and the desire for quick execution, which help to identify the manager as an informed trader and require increased inventory risk by the liquidity supplier.</li>
<li>Transactions costs are difficult to measure. At the same time, accurate estimates of transactions costs, especially distinctions in transactions costs among different stock trades, can significantly affect realized value added.</li>
<li>Transactions costs lower value added, but you can often achieve at least 75 percent of the value added with only half the turnover (and half the transactions costs). You can do better by distinguishing stocks by their transactions costs.</li>
<li>Trading is itself a portfolio optimization problem, distinct from the portfolio construction problem. Optimal trading can lower transactions costs, though at the expense of additional short-term risk.</li>
<li>There are several options for trade implementation, with rules of thumb on which to use when.
<ul class="org-ul">
<li>VWAP.</li>
<li>BARRA model.</li>
</ul></li>
</ul>
</div></li>

<li><a id="orgheadline28"></a>on portfolio side<br  /><div class="outline-text-5" id="text-7-2-3-2">
<ul class="org-ul">
<li>construct portfolio relative to industry neutral with categories.</li>
</ul>
</div></li></ol>
</div>
</div>
