finance/PortfolioOptimization.org
** SCREENS
- Rank the stocks by alpha.
- Choose the first 50 stocks (for example).
- Equal-weight (or capitalization-weight) the stocks.
  - rebalancing:
    - divide the stocks into three categores, top 40, next 60, remaining 100.
    - buy any stocks on the top 40 not in the portfolio.
    - sell any stocks on the bottom 100 in the portfolio.
    - holding any stocks on the middle in the portfolio.
  - pros:
    - The screen enhances alphas by concentrating the portfolio in the high-alpha stocks.
    - It strives for risk control by including a sufficient number of stocks (50 in the example) and by weighting them to avoid concentration in any single stock.
    - Transactions costs are limited by controlling turnover through judicious choice of the size of the buy, sell, and hold lists.
  - cons:
    - They ignore all information in the alphas apart from the rankings.
    - They do not protect against biases in the alphas.

** Stratification
- splitting the list of followed stocks into categories.
- classify the stocks in each sector by size: big, medium, and small.
- industry neutral.

** comparison with asset selection and asset allocation
The result is that portfolios constructed using returns-based analysis are very close to mean/variance portfolios, although they require much more effort to construct.
** solution
- placing limits on active stock positions.
- limiting turnover.
- constraining holdings in certain categories of stocks to match the benchmark holdings.
* Asset Allocation
Asset allocation comes in several varieties: strategic versus tactical, and domestic versus global.

The process of selecting a target asset allocation is called strategic asset allocation.

The variation in asset allocation around that target is called tactical asset allocation.
** tactical asset allocation
- stocks
- bonds
- cash
** asset allocation strategies is a three-step process:
- forecasting returns
- building portfolios
- analyzing out-of-sample performance.
* Black litterman model step-by-step
The Black-Litterman model uses a Bayesian approach to combine the subjective views of an investor regarding the expected returns of one or more assets with the market equilibrium vector of expected returns (the prior distribution) to form a new, mixed estimate of expected returns.

Black–Litterman model is a mathematical model for portfolio allocation developed in 1990 at Goldman Sachs by Fischer Black and Robert Litterman, and published in 1992. It seeks to overcome problems that institutional investors have encountered in applying modern portfolio theory in practice, although the covariances of a few assets can be adequately estimated, it is difficult to come up with reasonable estimates of expected returns. The model starts with the equilibrium assumption that the asset allocation of a representative agent should be proportional to the market values of the available assets, and then modifies that to take into account the 'views' (i.e., the specific opinions about asset returns) of the investor in question to arrive at a bespoke asset allocation.

Black–Litterman overcame this problem by not requiring the user to input estimates of expected return; instead it assumes that the initial expected returns are whatever is required so that the equilibrium asset allocation is equal to what we observe in the markets. The user is only required to state how his assumptions about expected returns differ from the market's and to state his degree of confidence in the alternative assumptions. From this, the Black–Litterman method computes the desired (mean-variance efficient) asset allocation.

In general, when there are portfolio constraints - for example, when short sales are not allowed
- the easiest way to find the optimal portfolio is to use the Black–Litterman model to generate the expected returns for the assets,
- and then use a mean-variance optimizer to solve the constrained optimization problem.
