docs/finance/PortfolioOptimization.html
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">7.3</span> SCREENS</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Rank the stocks by alpha.</li>
<li>Choose the first 50 stocks (for example).</li>
<li>Equal-weight (or capitalization-weight) the stocks.
<ul class="org-ul">
<li>rebalancing:
<ul class="org-ul">
<li>divide the stocks into three categores, top 40, next 60, remaining 100.</li>
<li>buy any stocks on the top 40 not in the portfolio.</li>
<li>sell any stocks on the bottom 100 in the portfolio.</li>
<li>holding any stocks on the middle in the portfolio.</li>
</ul></li>
<li>pros:
<ul class="org-ul">
<li>The screen enhances alphas by concentrating the portfolio in the high-alpha stocks.</li>
<li>It strives for risk control by including a sufficient number of stocks (50 in the example) and by weighting them to avoid concentration in any single stock.</li>
<li>Transactions costs are limited by controlling turnover through judicious choice of the size of the buy, sell, and hold lists.</li>
</ul></li>
<li>cons:
<ul class="org-ul">
<li>They ignore all information in the alphas apart from the rankings.</li>
<li>They do not protect against biases in the alphas.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">7.4</span> Stratification</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>splitting the list of followed stocks into categories.</li>
<li>classify the stocks in each sector by size: big, medium, and small.</li>
<li>industry neutral.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">7.5</span> comparison with asset selection and asset allocation</h3>
<div class="outline-text-3" id="text-7-5">
<p>
The result is that portfolios constructed using returns-based analysis are very close to mean/variance portfolios, although they require much more effort to construct.
</p>
</div>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">7.6</span> solution</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li>placing limits on active stock positions.</li>
<li>limiting turnover.</li>
<li>constraining holdings in certain categories of stocks to match the benchmark holdings.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-2">
<h2 id="orgheadline38"><span class="section-number-2">8</span> Asset Allocation</h2>
<div class="outline-text-2" id="text-8">
<p>
Asset allocation comes in several varieties: strategic versus tactical, and domestic versus global.
</p>

<p>
The process of selecting a target asset allocation is called strategic asset allocation.
</p>

<p>
The variation in asset allocation around that target is called tactical asset allocation.
</p>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">8.1</span> tactical asset allocation</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>stocks</li>
<li>bonds</li>
<li>cash</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">8.2</span> asset allocation strategies is a three-step process:</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>forecasting returns</li>
<li>building portfolios</li>
<li>analyzing out-of-sample performance.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">9</span> Black litterman model step-by-step</h2>
<div class="outline-text-2" id="text-9">
<p>
The Black-Litterman model uses a <b>Bayesian</b> approach to combine the subjective views of an investor regarding the expected returns of one or more assets with the market equilibrium vector of expected returns (the prior distribution) to form a new, mixed estimate of expected returns.
</p>

<p>
Black–Litterman model is a mathematical model for portfolio allocation developed in 1990 at Goldman Sachs by Fischer Black and Robert Litterman, and published in 1992. It seeks to overcome problems that institutional investors have encountered in applying modern portfolio theory in practice, although the covariances of a few assets can be adequately estimated, <b>it is difficult to come up with reasonable estimates of expected returns</b>. The model starts with the equilibrium assumption that the asset allocation of a representative agent should be proportional to the market values of the available assets, and then modifies that to take into account the 'views' (i.e., the specific opinions about asset returns) of the investor in question to arrive at a bespoke asset allocation.
</p>

<p>
Black–Litterman overcame this problem by not requiring the user to input estimates of expected return; instead it assumes that the initial expected returns are whatever is required so that the equilibrium asset allocation is equal to what we observe in the markets. <b>The user is only required to state how his assumptions about expected returns differ from the market's and to state his degree of confidence in the alternative assumptions</b>. From this, the Black–Litterman method computes the desired (mean-variance efficient) asset allocation.
</p>

<p>
In general, when there are portfolio constraints - for example, when short sales are not allowed
</p>
<ul class="org-ul">
<li>the easiest way to find the optimal portfolio is to use the Black–Litterman model to generate the expected returns for the assets,</li>
<li>and then use a mean-variance optimizer to solve the constrained optimization problem.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline40" class="outline-2">
<h2 id="orgheadline40"><span class="section-number-2">10</span> NLP</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Hidden factor model</li>
<li>portfolio optimization based on factor model</li>
<li>non linear constrain on factor model</li>
</ul>

<p>
accounting formula production function, using unit conversion, to do mathematical analysis.
</p>

<p>
opinions/factors can be used as constraints on factors with hiden factor model.
</p>

<p>
such factor constraints can be used in Black-Litterman model.
</p>
</div>
</div>
</div>
</body>
</html>
